app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["content", ""], ["created_at", "2016-04-29 15:25:30.102759"], ["updated_at", "2016-04-29 15:25:30.102759"]]
---
  def create
    @post = current_customer.posts.new(post_params)
    respond_to do |format|
      if @post.save

UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?
---
  def update
    respond_to do |format|
      if @post.update(post_params)